<?php 

$phone=$_POST['phone'];

include "SendTemplateSMS.php";

include "helper.php";




// $phone=17602507866;
// $code=123456;

//Demo调用 
		//**************************************举例说明***********************************************************************
		//*假设您用测试Demo的APP ID，则需使用默认模板ID 1，发送手机号是13800000000，传入参数为6532和5，则调用方式为           *
		//*result = sendTemplateSMS("13800000000" ,array('6532','5'),"1");																		  *
		//*则13800000000手机号收到的短信内容是：【云通讯】您使用的是云通讯短信模板，您的验证码是6532，请于5分钟内正确输入     *
		//*********************************************************************************************************************
		
$rand6=rand6();		
sendTemplateSMS("$phone",array("$rand6",'1'),"1");//手机号码，替换内容数组，模板ID

     // echo '<script>alert("退出成功，点击确定跳转到主页");</script>';

// echo $phone;
// echo $code;
$arr = array ('rand6'=>$rand6); 

echo json_encode($arr); 

?>